#+SETUPFILE: ~/.emacs.d/org-templates/template.org
#+TITLE: Org Mode


*** org-todo-keywords as sequences
如下所示.其中'|'用来区分未完成状态和完成状态.如果没有'|',那么最后一个则被当作完成状态.
#+BEGIN_SRC emacs-lisp
  (setq org-todo-keywords
        '((sequence "TODO" "FEEDBACK" "VERIFY" "|" "DONE" "DELEGATED")))
#+END_SRC

#+RESULTS:
| sequence | TODO | FEEDBACK | VERIFY |   |   | DONE | DELEGATED |
*** Multiple keyword sets in one file
这里一共定义了3组状态.使用诸如 =C-c C-t= 这些命令你只能在一组状态中循环使用.注意,这些关键字都不要重复,否则org-mode将无法准确识别这些状态.
#+BEGIN_SRC emacs-lisp
  (setq org-todo-keywords
        '((sequence "TODO" "|" "DONE")
          (sequence "REPORT" "BUG" "KNOWNCAUSE" "|" "FIXED")
          (sequence "|" "CANCELED")))
#+END_SRC

#+RESULTS:
| sequence | TODO   |     |            | DONE |   |       |
| sequence | REPORT | BUG | KNOWNCAUSE |      |   | FIXED |
| sequence |        |     | CANCELED   |      |   |       |
** Breaking Down Tasks into Subtasks
:PROPERTIES:
:END:
#+BEGIN_SRC org
  ,* Organize Party [33%]
  ,** TODO Call people [1/2]
  ,*** TODO Peter
  ,*** DONE Sarah
  ,** TODO Buy food
  ,** DONE Talk to neighbor
#+END_SRC
使用 =[%]= 来开启百分比
使用 =[/]= 来开启分数比
每次子item状态更新为完成时,父item的完成度也会随之更新.
修改变量 *org-hierarchical-todo-statistics* 来设置父item的状态更新的模式.如果它的值为t,那么只处理父item直接子item.否则每有子孙的item更新,父item的完成度就会更新.

也可以使用COOKIE_DATA来完成这个设置,只不过只对单个entry有效.
#+BEGIN_SRC org
  ,* TODO Parent capturing statistics [6/7]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :END:
  ,** TODO one
     - CLOSING NOTE [2020-03-04 Wed 22:49]
  ,*** DONE one-one
      CLOSED: [2020-03-04 Wed 22:49]
      - CLOSING NOTE [2020-03-04 Wed 22:49]
  ,*** DONE one-two
      CLOSED: [2020-03-04 Wed 22:47]
      - CLOSING NOTE [2020-03-04 Wed 22:47]
  ,** DONE two
     CLOSED: [2020-03-04 Wed 22:49]
     - CLOSING NOTE [2020-03-04 Wed 22:49]
  ,*** DONE two-one
      CLOSED: [2020-03-04 Wed 22:49]
      - CLOSING NOTE [2020-03-04 Wed 22:49]
  ,*** DONE two-two
      CLOSED: [2020-03-04 Wed 22:49]
      - CLOSING NOTE [2020-03-04 Wed 22:49]
  ,*** DONE two-three
      CLOSED: [2020-03-04 Wed 22:49]
      - CLOSING NOTE [2020-03-04 Wed 22:49]
#+END_SRC

定义如下函数: 当所有子item完成时,自动更新父item为完成.
#+BEGIN_SRC emacs-lisp
  (defun org-summary-todo (n-done n-not-done)
    "Switch entry to DONE when all subentries are done, to TODO otherwise."
    (let (org-log-done org-log-states) ; turn off logging
      (org-todo (if (= n-not-done 0) "DONE" "TODO"))))
  (add-hook 'org-after-todo-statistics-hook 'org-summary-todo)
#+END_SRC

#+RESULTS:
| org-summary-todo |
